Repository: 84000/data-translation-memory
Catalog: toh312-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡངས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པའི་མདོ་ཆེན་པོ།
en: The Noble Mahāsūtra Entering the City of Vaiśālī

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all the buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time:

source: བཅོམ་ལྡན་འདས་འདམ་བུའི་ཁྲོད་ན་གཟིངས་པའི་འདུག་གནས་ན་བཞུགས་ཏེ།
en: The Blessed One was residing in Nāḍikā, at the Impenetrable Dwelling Place.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the venerable Ānanda,

source: ཀུན་དགའ་བོ་ཡངས་པའི་གྲོང་ཁྱེར་ག་ལ་བ་དེར་འདོང་ངོ་། །
en: “Ānanda, let us proceed to the city of Vaiśālī.”

source: བཙུན་པ་དེ་ལྟར་བགྱིའོ་ཞེས་གསོལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་ཏོ། །
en: “Let us do so, O Honored One,” replied the venerable Ānanda, assenting to what the Blessed One had said.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་བྲྀ་ཛིར་རྒྱུ་ཞིང་གཤེགས་ཏེ། ཡངས་པའི་གྲོང་ཁྱེར་དུ་བྱོན་ནས།
en: Thereupon the Blessed One, traveling through the country of Vṛji, arrived in Vaiśālī.

source: ཡངས་པའི་གྲོང་ཁྱེར་གྱི་ཨ་མྲ་སྲུང་བའི་ཚལ་ན་བཞུགས་སོ། །
en: In Vaiśālī, he stayed in Āmrapālī’s grove.

source: ཀུན་དགའ་བོ་ཡངས་པའི་གྲོང་ཁྱེར་དུ་སོང་ལ་ཕྱིན་ནས་སྒོའི་ཐེམ་པ་ལ་རྐང་པ་ཞོག་སྟེ།
en: “Ānanda, go to the city of Vaiśālī, place your foot on the threshold of the city gate, and

source: གསང་སྔགས་ཀྱི་གཞི་འདི་དག་དང་། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲོས་ཤིག །
en: utter these mantras and these verses:

source: བི་ས་ར་ཏ། བི་ས་ར་ཏ། བི་ས་ར་ཏ། བི་ས་ར་ཏ།
en: “ ‘ Visarata visarata visarata visarata

source: སངས་རྒྱས་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཅན་གྱིས་བཀའ་སྩལ་ཏོ། །
en: “ ‘The Buddha, who has compassion for the world, has spoken.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དགོངས་པ།
en: This is the wish of all buddhas.

source: རང་སངས་རྒྱས་ཀྱིས་བསམས་པ།
en: It is the wish of all pratyekabuddhas.

source: དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all arhats.

source: སློབ་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all those undergoing training.

source: ཉན་ཐོས་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all śrāvakas.

source: བདེན་པའི་ཚིག་དང་ལྡན་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all who speak words of truth.

source: ཆོས་ཀྱིས་བསམས་པ།
en: It is the wish of the Dharma.

source: ཚངས་པས་བསམས་པ།
en: It is the wish of Brahmā.

source: ཚངས་པ་སོ་སོས་བསམས་པ།
en: It is the wish of Pratyeka­brahman.

source: འདོད་པའི་དབང་ཕྱུག་གིས་བསམས་པ།
en: It is the wish of Kāmeśvara.

source: དབང་པོས་བསམས་པ།
en: It is the wish of Indra.

source: ལྷས་བསམས་པ།
en: It is the wish of the gods.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོས་བསམས་པ།
en: It is the wish of the lord of the demigods.

source: ལྷ་མ་ཡིན་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all demigods.

source: ལྷ་མ་ཡིན་གྱི་མངག་གཞུག་པས་བསམས་པ།
en: It is the wish of the servants of the demigods.

source: འབྱུང་པོ་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of all bhūtas:

source: མུན་ཙྪ་ཏ། མུན་ཙྪ་ཏ།
en: “ ‘ Muñcata muñcata

source: མ་འདུག་ཤིག །
en: “ ‘Do not stay.

source: ཡམས་ཀྱི་ནད་རྣམ་པར་ཞི་བར་གྱུར་ཅིག །
en: The epidemic should cease.

source: ནི་ར་ག་ཙྪ་ཏ། ནི་ར་ག་ཙྪ་ཏ། ནིར་ག་ཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། ནི་ར་ག་ཙྪ་ཏ།
en: “ ‘ Nirgacchata nirgacchata nirgacchata nirgacchata

source: སངས་རྒྱས་ལྷ་ཆེན་པོ་ལྷའི་ཡང་ལྷ། ལྷའི་བླ་མ་ཡང་གཤེགས་ཤིང་།
en: “ ‘The Buddha, the Great God, the God of Gods, the Supreme God, has arrived.

source: དབང་པོ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། ཚངས་པ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། སྐྱེ་དགུའི་དབང་པོ་དང་བཅས་པ་རྣམས་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་དག་ཀྱང་འོང་།
en: The gods including Indra, the gods including Brahmā, the gods including Īśāna, the gods including Prajāpati, and the Four Protectors of the World have come.

source: ལྷ་འབུམ་ཕྲག་དུ་མ་དག་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་དང་། ལྷ་མ་ཡིན་འབུམ་ཕྲག་དུ་མ་དག་ཀྱང་འོང་།
en: Hundreds of thousands of gods, lords of the demigods, and hundreds of thousands of demigods have also come.

source: བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པའི་འབྱུང་པོ་འབུམ་ཕྲག་དུ་མ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་འོང་སྟེ། །
en: Hundreds of thousands of bhūtas who have faith in the Blessed One have also come for the sake of all living beings, and

source: དེ་དག་གིས་ཁྱེད་རྣམས་ལ་གནོད་པ་ཆེན་པོ་བྱེད་པར་འགྱུར་དུ་འོང་གིས།
en: they have come to bring great harm to you; so:

source: ནི་ར་གད་ཙྪ་ཏ། ནིར་གད་ཙྪ་ཏ། ནི་ར་གད་ཙྪ་ཏ། ནི་ར་ར་གད་ཙྪ་ཏ། ནི་ར་གད་ཙྪ་ཏ།
en: “ ‘ Nirgacchata nirgacchata nirgacchata nirgacchata

source: མྱུར་དུ་བྱེར་ཅིག་ཁྱེད་ཅག་ལས་གང་དག་སྡང་བའི་སེམས་དང་ལྡན་པ་དེ་དག་ནི་ཕུང་བར་གྱུར་ཅིག །
en: “ ‘Disperse quickly. Those of you who have hateful thoughts, may you be destroyed.

source: གང་དག་བྱམས་པའི་སེམས་དང་ལྡན་ཞིང་ཉེས་པར་མི་འདོད་ལ་སྲུང་བར་འཇུག་པར་འདོད་པ་དེ་དག་ནི་འཁོད་ཅིག །
en: Those who have loving thoughts, who do not wish to sin but wish to protect beings, stay

source: ལུས་ལ་ཡང་འཇུག་པར་གྱིས་ཤིག །
en: and take on physical form.

source: སངས་རྒྱས་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཅན་གྱིས་བཀའ་སྩལ་པ། སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རཱུ་རཱི་ཏི། རི་རི་རི་རི་རི་རི། རཱི་རཱི་རཱི་རཱི་རཱི་རཱི་ཏི། མི་རི་མི་རི་མི་རི་མི་རི་ཏི། ཧི་སི་མི་རི། མི་རི་ཏི། མི་རི་སི། སཱི་སཱི་སཱི། ཀང་ཀ་རཱ། ཀ་ར་ཀ་ཏ། ཀང་ཀ་རཱ། ཀ་ར་ཀ་ཙ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རཱ། ཀང་ཀ་རོ་ཏི་ཏི། ཀུ་རི་ཤོ། ཀང་ཀ་ར་ཀང་ཀ་རི་ཤི། རི་རི་རི་རི་རི་རི། ཧི་རི་ཏ་ཕུ་སྭ། རི་པུ། །རི་པུ། །རི་པུ། །རི་པུ། །རི་པུ། །རི་པུ། །རི་པུ། །རི་པུ། །ནཱ་ཐཱ། ནཱ་ནཱ། ཐཱ་ཐཱ། རི་པུ་རི་པུ། ནཱ་ཐཱ་ཐཱ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། རི་པུ། །རི་པུ། ནི་ར་གཙྪ་ཏ། པ་ལཱ་ཡཱ་ཏ། རི་པཱུ་རི་པཱུ། པ་ལཱ་ཡཱ་ཏ།
en: The Buddha, who has compassion for the world, has spoken. “ ‘ Sumu sumu | sumu sumu sumu | sumuru sumuru | sumuru sumuru | sumuru sumuru | sumuru sumuru | muru muru | muru muru | muru muru | muru muru | miri miri | miri miri | miri miri miri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murūrīti | riri riri riri | rīrī rīrī rīrīti | miri miri miriti | hisi miri miriti | mirisi sīsīmī | kaṅkarā karakata | kaṅkarā karakacā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkaro titi kuriśo | kaṅkara kaṅkariśi | ririri ririri | hiritaphu svā | ripu ripu | ripu ripu | ripu ripu | ripu ripu | nāthā nānā | thā thā | ripu ripu | nāthātha | nirgacchata nirgacchata | ripu ripu | nirgacchata palāyāta | ripū ripū pālāyata |

source: སངས་རྒྱས་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་ལྷག་པར་དགོངས་པ་དང་ལྡན་པ། བྱམས་པ་ལ་གནས་པ། ཐུགས་རྗེ་དང་ལྡན་པ། དགའ་བ་ལ་གནས་པ། བཏང་སྙོམས་ལ་གནས་པ་གཤེགས་ཀྱིས།
en: “ ‘The Buddha, who has compassion for the world, whose wish is to benefit all living beings, who abides in love, who is compassionate, who abides in joy, and who abides in equanimity, has arrived.

source: ཀྵི་ཕྲན་ནི་ར་གཙྪ་ཏ་སྭཱ་ཧཱ།
en: “ ‘ Kṣipraṃ nirgacchata svāhā

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་མཆོག་དང་། ཆོས་ཉིད་ཀྱིས་ལྷ་ཐམས་ཅད་དང་། འབྱུང་པོ་ཐམས་ཅད་ལ་བཀའ་སྩལ་པའི་གསང་སྔགས་གཞི་འདི་དག་ནི་འགྲུབ་བོ། །
en: “These mantras, which were proclaimed to all the gods and all the bhūtas through the Buddha’s supreme wisdom and truth, will accomplish their purpose.

source: ཚིགས་སུ་བཅད་པ་འདི་དག་ནི་འགྲུབ་བོ། །
en: The following verses will accomplish their purpose:

source: གང་ལ་སེར་སྣ་རྣམ་ཆགས་པ། །རྣམ་བཅོམ་དྲི་མ་མེད་མཛད་ཅིང་། །ཐུགས་ཞི་གནོད་པ་མི་མངའ་དེཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He in whom all attachment and greed Are conquered, all defilement gone, His mind at peace without harmful intent— He will bring you well-being.

source: འདྲེན་པ་གང་ཞིག་འགྲོ་བ་རྣམས། །ཐར་པའི་ལམ་དུ་འཛུད་མཛད་ཅིང་། ཆོས་རྣམས་ཐམས་ཅད་སྟོན་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He who leads all worldly beings To tread the path of liberation, The teacher of all dharmas— He will bring you well-being.

source: སྟོན་པ་རྒྱུ་བ་རྣམས་ཀྱི་རྟེན། །སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར། །གང་གིས་བདེ་བ་མངའ་མཛད་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘The teacher, support of wandering beings, Who, for the sake of every living creature, Brings them all to master happiness— He will bring you well-being.

source: སྐྱོབ་པ་གང་ཞིག་བྱམས་པ་ཡིས། །ཐུགས་ཀྱི་འགྲོ་བ་འདི་དག་ཀུན། །བུ་གཅིག་བཞིན་དུ་རྟག་བསྐྱངས་ཏེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘The protector who, with thoughts of love For all these beings, sustains them always Just as he would his only child— He will bring you well-being.

source: གང་ཞིག་འཁོར་བར་འཁོར་བ་ཡི། སེམས་ཅན་ཀུན་གྱི་རྟེན་གྱུར་ཅིང་། །གླིང་དང་དཔུང་གཉེན་གྱུར་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He who in saṃsāra has been For all saṃsāric beings a support, An island, and a friend— He will bring you well-being.

source: གང་ཞིག་ཆོས་ཀུན་མངོན་སུམ་གྱུར། །གཙང་ཞིང་སླུ་བ་མི་མངའ་ལ། །གསུང་གཙང་གཙང་མར་མཛད་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He who has laid bare all phenomena, Who is pure and free from deception, Whose words are pure, whose very acts are purity— He will bring you well-being.

source: དཔའ་བོ་ཆེན་པོ་གང་སྐྱེས་པས། །ཕུན་སུམ་ཚོགས་དོན་འབྱོར་གྱུར་ཅིང་། །དོན་གྲུབ་ཚོགས་ཀྱང་གྲུབ་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘This great hero who, by taking birth, With perfection attained his purpose And accomplished all his goals — He will bring you well-being.

source: གང་ཞིག་སྐྱེས་པས་ས་རྣམས་ནི། །ནགས་ཚལ་བཅས་པར་རབ་གཡོས་ཤིང་། །སེམས་ཅན་ཐམས་ཅད་རབ་དགའ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He whose birth, when this whole earth With all its forests shook and trembled, Brought joy for every living creature— He will bring you well-being.

source: བྱང་ཆུབ་སྙིང་པོར་གང་ཞིག་གིས། །ས་དག་རྣམ་དྲུག་གཡོས་གྱུར་ཅིང་། །བདུད་ཡིད་མི་བདེར་གྱུར་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He who caused, on the seat of awakening, The earth to quake in all six ways And Māra to feel despair— He will bring you well-being.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ན། །འཕགས་པའི་བདེན་པ་རྣམ་གསུངས་པ། །ཐུབ་པའི་སྙན་པ་གང་བྱུང་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘He who, turning the wheel of the Dharma, Pronounced the Truths of the Noble Ones And was extolled as a sage, the Muni— He will bring you well-being.

source: ཡིད་འཕྲོག་གང་གིས་མུ་སྟེགས་བྱེད། །ཐམས་ཅད་ཆོས་ཀྱིས་ཕམ་མཛད་ཅིང་། །ཚོགས་ཀུན་དབང་དུ་མཛད་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “ ‘The alluring one who defeated All the extremists with the Dharma And brought all assemblies under his influence— He will bring you well-being.

source: སངས་རྒྱས་ཁྱེད་ལ་བདེ་ལེགས་མཛད། །
en: “ ‘May the Buddha bring you well-being;

source: བརྒྱ་བྱིན་ལྷར་བཅས་བདེ་ལེགས་དང་། །འབྱུང་པོ་ཀུན་གྱིས་བདེ་ལེགས་ནི། །ཁྱེད་ལ་རྟག་ཏུ་སྦྱིན་གྱུར་ཅིག །
en: May Śakra and the gods bestow well-being; And may well-being from the bhūtas, too, Be provided to you always.

source: སངས་རྒྱས་བསོད་ནམས་མཐུ་དག་དང་། །ལྷ་རྣམས་ཀྱི་ནི་བསམས་པ་ཡིས། །ཁྱེད་རྣམས་དོན་འདོད་གང་ཡིན་པ། །དོན་དེ་དེ་རིང་གྲུབ་གྱུར་ཅིག །
en: “ ‘By the Buddha’s merit and power And the wishes of the gods, May whatever goal you seek This very day be accomplished.

source: རྐང་གཉིས་ཁྱེད་ཅག་བདེ་ལེགས་ཤོག །
en: “ ‘Two-legged beings, be well.

source: རྐང་བཞི་ཁྱེད་ཅག་བདེ་ལེགས་ཤོག །
en: Four-legged beings, be well.

source: ཁྱེད་ཅག་ལམ་འགྲོ་བདེ་ལེགས་ཤོག །
en: When you set out, be well;

source: ཕྱིར་འོང་དག་ཀྱང་བདེ་ལེགས་ཤོག །
en: And when you return, be well.

source: ཉིན་མོ་བདེ་ལེགས་མཚན་བདེ་ལེགས། །ཉི་མའི་གུང་ལའང་བདེ་ལེགས་ཤིང་། །ཁྱེད་ཅག་ཀུན་ཏུ་བདེ་ལེགས་ཤོག །
en: “ ‘Be well in the daytime; be well in the night; Be well at midday, too. May all of you be always well;

source: ཁྱེད་ཅག་སྡིག་པར་མ་གྱུར་ཅིག །
en: May all of you know no evil.

source: སངས་རྒྱས་ལྷ་རྣམས་སྟོང་དག་གིས། །ཡོངས་སུ་བསྐོར་ཏེ་
en: “ ‘Surrounded by a thousand gods, The Buddha has arrived— So, you with hateful thoughts, disperse! And you whose nature is compassion, stay.

source: གཤེགས་མཛད་ཀྱིས། །སྡང་སེམས་ལྡན་པ་རྣམས་བྱེར་ཅིང་། །སྙིང་རྗེའི་བདག་ཉིད་ཅན་རྣམས་འཁོད། །སངས་རྒྱས་རང་སངས་རྒྱས་རྣམས་དང་། །དགྲ་བཅོམ་སློབ་པའི་བདེན་ཚིག་གིས། །འཇིག་རྟེན་མི་ཕན་བྱེད་པ་རྣམས། །གྲོང་ཁྱེར་འདི་ནི་གཏོང་གྱུར་ཅིག །
en: “ ‘By the power of the true words of the buddhas, Pratyekabuddhas, arhats, and those being trained, Those who do harm to the world Should be gone from this city.

source: སེམས་ཅན་ཀུན་དང་སྲོག་ཆགས་ཀུན། །འབྱུང་པོ་ཀུན་དང་ཁྱེད་ཅག་ཀུན། །བདེ་བ་འབའ་ཞིག་ལྡན་གྱུར་ཅིག །
en: “ ‘All sentient beings, all living creatures, All bhūtas, and every one of you— May you have nothing but happiness.

source: ཐམས་ཅད་ནད་རྣམས་མེད་པར་ཤོག །
en: May you all be free from illness.

source: ཀུན་གྱིས་བཟང་རྣམས་མཐོང་གྱུར་ཅིག །
en: May you all see what is good.

source: གང་ཡང་སྡིག་པར་མ་གྱུར་ཅིག །
en: May all of you know no evil.

source: འབྱུང་པོ་གང་དག་འདིར་ནི་ལྷགས་གྱུར་ཅིང་། །ས་དང་བར་སྣང་དག་ལ་གནས་པ་རྣམས། །སྐྱེ་དགུ་རྣམས་ལ་རྟག་ཏུ་བྱམས་བྱེད་ཤོག །ཉིན་དང་མཚན་དུ་ཆོས་ཀྱང་སྤྱོད་གྱུར་ཅིག །
en: “ ‘May whatever bhūtas are assembled here, All those who live upon the earth or in the sky, Act always lovingly for human beings And practice Dharma day and night.’ ”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཙུན་པ་དེ་བཞིན་བགྱིའོ་ཞེས་གསོལ་ཏེ།
en: To these instructions, the venerable Ānanda replied, “I will do so, O Honored One.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་ཡངས་པའི་གྲོང་ཁྱེར་དུ་སོང་སྟེ་སྒོའི་ཐེམ་པ་ལ་རྐང་པ་བཞག་ནས།
en: He went to Vaiśālī as the Blessed One had instructed and, placing his foot on the threshold of the city gate,

source: གསང་སྔགས་གཞི་དག་དང་། ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་སྨྲས་སོ། །
en: uttered these mantras and these verses:

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དགོངས་པ། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསམས་པ། དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ། སློབ་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ། ཉན་ཐོས་ཐམས་ཅད་ཀྱིས་བསམས་པ། བདེན་པའི་ཚིག་དང་ལྡན་པ་ཐམས་ཅད་ཀྱིས་བསམས་པ། ཆོས་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: This is the wish of all buddhas. It is the wish of all pratyekabuddhas. It is the wish of all arhats. It is the wish of all those undergoing training. It is the wish of all śrāvakas. It is the wish of all who speak words of truth. It is the wish of all the Dharmas.

source: ཚངས་པས་བསམས་པ། ཚངས་པ་སོ་སོས་བསམས་པ། འདོད་པའི་དབང་ཕྱུག་གིས་བསམས་པ། དབང་པོས་བསམས་པ། ལྷས་བསམས་པ། ལྷ་མ་ཡིན་གྱི་དབང་པོས་བསམས་པ། ལྷ་མ་ཡིན་ཐམས་ཅད་ཀྱིས་བསམས་པ། ལྷ་མ་ཡིན་གྱི་མངག་གཞུག་པས་བསམས་པ། འབྱུང་པོ་ཐམས་ཅད་ཀྱིས་བསམས་པ།
en: It is the wish of Kāmeśvara. It is the wish of Brahmā. It is the wish of Pratyeka­brahman. It is the wish of Indra. It is the wish of the gods. It is the wish of the lord of the demigods. It is the wish of all demigods. It is the wish of the servants of the demigods. It is the wish of all bhūtas.

source: ཡམས་ཀྱི་ནད་རྣམས་ཞི་བར་གྱུར་ཅིག །
en: The epidemic should cease.

source: ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ།
en: “ Nirgacchata nirgacchata nirgacchata nirgacchata

source: སངས་རྒྱས་ལྷ་ཆེན་པོ་ལྷའི་ཡང་ལྷ། ལྷའི་བླ་མ་གཤེགས་ཤིང་།
en: “The Buddha, the Great God, the God of Gods, the Supreme God, has arrived.

source: དབང་པོ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། ཚངས་པ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། དབང་བདག་དང་བཅས་པ་རྣམས་དང་། སྐྱེ་དགུའི་བདག་པོ་དང་བཅས་པ་རྣམས་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་དག་ཀྱང་འོང་།
en: The gods including Indra, the gods including Brahmā, the gods including Īśāna, the gods including Prajāpati, and the Four Protectors of the World have come.

source: ལྷ་སྟོང་ཕྲག་དུ་མ་དག་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་དང་། ལྷ་མ་ཡིན་སྟོང་ཕྲག་དུ་མ་དག་ཀྱང་འོང་།
en: Hundreds of thousands of gods, lords of the demigods, and hundreds of thousands of demigods have also come.

source: བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པའི་འབྱུང་པོ་བརྒྱ་སྟོང་མང་པོ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་འོང་སྟེ།
en: Hundreds of thousands of bhūtas who have faith in the Blessed One have also come for the sake of all living beings, and

source: དེ་དག་ཁྱེད་ལ་གནོད་པ་ཆེན་པོ་བྱེད་པར་འགྱུར་གྱིས། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ།
en: they have come to bring great harm to you; so: “ Nirgacchata nirgacchata nirgacchata nirgacchata

source: མྱུར་དུ་བྱེར་ཅིག །
en: “Disperse quickly.

source: ཁྱེད་ཅག་ལས་གང་དག་སྡང་བའི་སེམས་དང་ལྡན་པ་དེ་དག་ནི་ཕུང་བར་གྱུར་ཅིག །
en: Those of you who have hateful thoughts, may you be destroyed.

source: གང་དག་བྱམས་པའི་སེམས་དང་ལྡན་ཞིང་ཉེས་པར་མི་འདོད་ལ་སྲུང་བར་འཇུག་པར་འདོད་པ་དེ་དག་ནི་འཁོད་ཅིག །ལུས་ལ་ཡང་འཇུག་པར་གྱིས་ཤིག །
en: Those who have loving thoughts, who do not wish to sin but wish to protect beings, stay and take on physical form.

source: སངས་རྒྱས་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཅན་གྱིས་བཀའ་སྩལ་པ།
en: The Buddha, who has compassion for the world, has spoken.

source: སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། སུ་མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མུ་རུ། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་མི་རི། མུ་རུ་རི་ཏི། རི་རི་རི་རི་རི་རི། རཱི་རཱི་རཱི་རཱི་རཱི་རཱི་ཏི། མི་རི་མི་རི། མི་རི་མི་རཱི་ཏི། ཧི་སི་མི་རི་མི་རི་ཏི། མི་རི་སི། སཱི་སི་མི། ཀང་ཀ་རཱ། ཀ་ར་ཀ་ཏ། ཀང་ར་ཀ་ར། ཀ་ར་ཀ་ཙ། ཀང་ཀ་ར། ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱ། །ཀང་ཀ་རཱོ་ཏཱི་ཏི། ཀུ་རི་ཤོ། ཀང་ཀ་རཱ། །ཀང་ཀ་རི་ཤི། རི་རི་རི་རི་རི་རི། ཏི་རི་ཏ་ཕུ་སྭ། །རི་ཕུ། རི་ཕུ། རི་ཕུ། རི་ཕུ། རི་ཕུ། རི་ཕུ། རི་ཕུ། རི་ཕུ། ནཱ་ཐཱ། ནཱ་ནཱ་ཐཱ་ཐཱ། རི་པཱུ། རི་པཱུ། ནཱ་ཐཱ་ཐཱ། ནི་ར་གཙྪ་ཏ། ནི་ར་གཙྪ་ཏ། རི་པུ། རི་པུ། ནི་ར་གཙྪ་ཏ། པ་ལཱ་ཡཱ་ཏ། རི་པཱུ་རི་པཱུ། པ་ལ་ཡཱ་ཏཱ།
en: “ Sumu sumu | sumu sumu sumu | sumuru sumuru | sumuru sumuru | sumuru sumuru | sumuru sumuru | muru muru | muru muru | muru muru | muru muru | miri miri | miri miri | miri miri miri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murumiri | murumiri murūrīti | riri riri riri | rīrī rīrī rīrīti | miri miri mirīti | hisi miri miriti | mirisi sīsīmī | kaṅkarā karakata | kaṅrakara karakaca | kaṅkara kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkarā kaṅkarā | kaṅkaro tīti kuriśo | kaṅkara kaṅkariśi | ririri ririri | tiritaphu svā | riphu riphu | riphu riphu | riphu riphu | riphu riphu | nāthā nānā | thā thā | ripū ripū | nāthāthā | nirgacchata nirgacchata | ripu ripu | nirgacchata palāyāta | ripū ripū palayātā |

source: སངས་རྒྱས་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་ལྷག་པར་དགོངས་པ་དང་ལྡན་པ། །བྱམས་པ་ལ་གནས་པ། ཐུགས་རྗེ་དང་ལྡན་པ། དགའ་བ་ལ་གནས་པ། བཏང་སྙོམས་ལ་གནས་པ་གཤེགས་ཀྱིས།
en: “The Buddha, who has compassion for the world, whose wish is to benefit all living beings, who abides in love, who is compassionate, who abides in joy, and who abides in equanimity, has arrived.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་མཆོག་དང་། ཆོས་ཉིད་ཀྱིས་ལྷ་ཐམས་ཅད་དང་། འབྱུང་པོ་ཐམས་ཅད་ལ་བཀའ་སྩལ་པའི་གསང་སྔགས་གཞི་འདི་དག་ནི་གྲུབ་པའོ། །
en: “These mantras, which were proclaimed to all the gods and all the bhūtas through the Buddha’s supreme wisdom and truth, will accomplish their purpose.

source: ཚིགས་སུ་བཅད་པ་འདི་དག་ནི་གྲུབ་པའོ། །
en: The following verses will accomplish their purpose:

source: གང་ལ་སེར་སྣ་རྣམས་ཆགས་པ། །རྣམ་བཅོམ་དྲི་མ་མེད་མཛད་ཅིང་། །ཐུགས་ཞི་གནོད་པ་མི་མངའ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “He in whom all attachment and greed Are conquered, all defilement gone, His mind at peace without harmful intent— He will bring you well-being.

source: འདྲེན་པ་གང་ཞིག་འགྲོ་བ་རྣམས། །ཐར་པའི་ལམ་དུ་འཛུད་མཛད་ཅིང་། །ཆོས་རྣམས་ཐམས་ཅད་སྟོན་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “He who leads all worldly beings To tread the path of liberation, The teacher of all dharmas— He will bring you well-being.

source: སྟོན་པ་རྒྱུག་པ་རྣམས་ཀྱི་རྟེན། །སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར། །གང་གིས་བདེ་བ་མངའ་མཛད་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “The teacher, support of wandering beings, Who, for the sake of every living creature, Brings them all to master happiness— He will bring you well-being.

source: སྐྱོབ་པ་གང་ཞིག་བྱམས་པ་ཡི། །ཐུགས་ཀྱིས་འགྲོ་བ་འདི་དག་ཀུན། །བུ་གཅིག་བཞིན་དུ་རྟག་བསྐྱངས་ཏེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “The protector who, with thoughts of love For all these beings, sustains them always Just as he would his only child— He will bring you well-being.

source: གང་ཞིག་འཁོར་བར་འཁོར་བ་ཡི། །སེམས་ཅན་ཀུན་གྱི་རྟེན་གྱུར་ཅིང་། །གླིང་དང་དཔུང་གཉེན་གྱུར་པ་དེ། །ཁྱེད་ལ་བདེ་ལེགས་མཛད་པར་འགྱུར། །
en: “He who in saṃsāra has been For all saṃsāric beings a support, An island, and a friend— He will bring you well-being.

source: བརྒྱ་བྱིན་ལྷར་བཅས་བདེ་ལེགས་དང་། །འབྱུང་པོ་ཀུན་ཀྱང་བདེ་ལེགས་ནི། །ཁྱེད་ལ་རྟག་ཏུ་སྦྱིན་གྱུར་ཅིག །
en: May Śakra and the gods bestow well-being; And may well-being from the bhūtas, too, Be provided to you always.

source: སངས་རྒྱས་བསོད་ནམས་མཐུ་དག་དང་། །ལྷ་རྣམས་ཀྱི་ནི་བསམས་པ་ཡིས། །ཁྱེད་ཀྱི་དོན་འདོད་གང་ཡིན་པ། །དོན་དེ་དེ་རིང་འགྲུབ་གྱུར་ཅིག །
en: “By the Buddha’s merit and power And the wishes of the gods, May whatever goal you seek This very day be accomplished.

source: རྐང་བཞི་ཁྱེད་ཅག་བདེ་ལེགས་ཤོག་
en: Four-legged beings, be well.

source: ཕྱིར་འོང་རྣམས་ཀྱང་བདེ་ལེགས་ཤོག །
en: And when you return, be well.

source: སངས་རྒྱས་ལྷ་རྣམས་སྟོང་དག་གིས། །ཡོངས་སུ་བསྐོར་ཏེ་གཤེགས་མཛད་ཀྱིས། །སྡང་སེམས་ལྡན་པ་རྣམས་བྱེར་ཅིག །
en: “Surrounded by a thousand gods, The Buddha has arrived— So, you with hateful thoughts, disperse!

source: སྙིང་རྗེའི་བདག་ཉིད་ཅན་རྣམས་འཁོད། །
en: And you whose nature is compassion, stay.

source: སངས་རྒྱས་རང་སངས་རྒྱས་རྣམས་དང་། །དགྲ་བཅོམ་སློབ་པའི་བདེན་ཚིག་གིས། །འཇིག་རྟེན་མི་ཕན་བྱེད་པ་རྣམས། །གྲོང་ཁྱེར་འདི་ནི་གཏོང་གྱུར་ཅིག །
en: “By the power of the true words of the buddhas, Pratyekabuddhas, arhats, and those being trained, Those who do harm to the world Should be gone from this city.

source: འབྱུང་པོ་གང་དག་འདིར་ནི་ལྷགས་གྱུར་ཅིང་། །ས་དང་བར་སྣང་དག་ན་གནས་པ་རྣམས། །སྐྱེ་དགུ་རྣམས་ལ་རྟག་ཏུ་བྱམས་བྱེད་ཤོག །ཉིན་དང་མཚན་དུ་ཆོས་ཀྱང་སྤྱོད་གྱུར་ཅིག །
en: “May whatever bhūtas are assembled here, All those who live upon the earth or in the sky, Act always lovingly for human beings And practice Dharma day and night.”

source: འཕགས་པ་ཡངས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པའི་མདོ་ཆེན་པོ་རྫོགས་སོ།། །
en: This completes the Noble Mahāsūtra “On Entering the City of Vaiśālī.”
